{
  "accesskeys": "Duplicate access keys cause keyboard shortcuts to malfunction, leaving users unable to navigate the page effectively.",
  "area-alt": "Image map areas require descriptions so screen reader users know where these interactive 'hotspots' lead.",
  "aria-hidden-focus": "Hiding an element from screen readers while keeping it focusable creates a 'ghost' element that confuses keyboard users.",
  "button-name": "Buttons without text (like icon-only buttons) give screen reader users no indication of what clicking them will do.",
  "bypass": "Skip links allow keyboard users to jump past repetitive navigation and get straight to the main content, saving time and effort.",
  "color-contrast": "Text with low contrast is difficult for users with low vision or those in bright environments to read.",
  "duplicate-id-active": "Duplicate IDs on buttons or links can cause assistive technology to skip elements or trigger the wrong action entirely.",
  "empty-heading": "Empty headings clutter the page structure for screen reader users, making it harder to find the actual content they need.",
  "focus-visible": "A visible focus indicator is the 'mouse cursor' for keyboard users; without it, they cannot see which element they are currently on.",
  "frame-title": "Frames require names so users navigating via assistive technology can identify the purpose of the embedded content.",
  "heading-order": "A logical heading hierarchy (H1, then H2, etc.) acts as a table of contents, helping users build a mental map of the page.",
  "html-has-lang": "Setting a language allows screen readers to use the correct accent and pronunciation, preventing the content from sounding like gibberish.",
  "image-alt": "Screen reader users rely on text descriptions to understand the meaning, context, and purpose of images.",
  "image-redundant-alt": "Repeating the same text in an image description and an adjacent caption creates a repetitive and annoying experience for screen reader users.",
  "input-image-alt": "Image-based buttons require alternative text so users know the function of the button (e.g., 'Search' or 'Submit').",
  "label": "Form fields without labels are inaccessible to screen reader users and make it impossible for them to know what data to enter.",
  "landmark-no-duplicate-main": "A page should only have one primary content area. Multiple 'main' landmarks confuse screen reader users who use them to jump straight to the unique content of a page.",
  "landmark-one-main": "Without a 'main' landmark, users navigating via assistive technology have no quick way to bypass navigation menus and get straight to the primary content.",
  "landmark-banner-is-top-level": "The banner (header) should be a direct child of the document. Nesting it inside other areas makes it harder for users to locate the site's global branding and search.",
  "landmark-contentinfo-is-top-level": "The contentinfo (footer) landmark provides essential metadata and contact info; nesting it inside other sections can hide it from structural navigation tools.",
  "link-name": "Links need clear, unique text so users know exactly where a link goes before they decide to click it.",
  "list": "Proper list markup tells screen readers how many items are in a group, helping users understand the scale of the information provided.",
  "region": "Landmarks (like 'nav' or 'main') allow users to skip directly to specific sections of the page without having to tab through everything else.",
  "scrollable-region-focusable": "If a scrolling box isn't focusable, keyboard users can't scroll through the content, effectively 'locking' it away from them.",
  "select-name": "Dropdown menus without names prevent screen reader users from knowing what selection they are being asked to make.",
  "tabindex": "Using a tabindex greater than 0 disrupts the natural navigation flow, making the page unpredictable and frustrating for keyboard users.",
  "valid-lang": "Using an invalid language code prevents screen readers from loading the correct voice profile for that specific language."
}